app/controllers/activities_controller.rb

  def index
    @user = User.find(params[:user_id])
    @activities = Activity.paginate :page => params[:page], :conditions => {:user_id => params[:user_id]}, :order => "created_at", :per_page => 25
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `activities` WHERE (`activities`.`user_id` = '1') ORDER BY created_at LIMIT 0, 25

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)