app/controllers/posts_controller.rb

  def index
    @topic = Topic.find(params[:topic_id])
    @user = @topic.user

    @posts = Post.paginate :page => params[:page], :conditions => {:topic_id => params[:topic_id]}, :order => "position", :per_page => 10

    @sub_users = @topic.users.find(:all, :limit => 8, :order => 'created_at desc')
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 9) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 20:23:02')
SELECT * FROM `posts` WHERE (`posts`.`topic_id` = '9') AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 20:23:02') ORDER BY position LIMIT 0, 25
SELECT count(*) AS count_all FROM `posts` WHERE (`posts`.`topic_id` = '15') AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-23 21:18:44')
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.deleted_at IS NULL OR users.deleted_at > '2010-06-09 20:23:02') LIMIT 1

  def show
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
SELECT * FROM `posts` WHERE (`posts`.`id` = 10)

  def new
#    @post = Post.new
    @post = Post.new(:topic_id => params[:topic_id])
    @topic = Topic.find(params[:topic_id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 15) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-23 21:53:42')

  def create

    @post = Post.new(params[:post])
    @post.topic_id = params[:topic_id]
    @post.user_id = current_user.id
    @post.replied_at = Time.now
    @post.ip = get_client_ip request

    respond_to do |format|
      if @post.save
        @post.move_to_top
        topic = @post.topic
        unless Subscription.find (:first, :conditions => {:user_id => current_user.id, :topic_id => topic.id})
          current_user.topics << topic
        end
        topic.posts_count += 1
        topic.save
---
INSERT INTO `posts` (`topic_id`, `updated_at`, `title`, `text`, `replied_at`, `deleted_at`, `replies_count`, `ip`, `user_id`, `position`, `viewed_count`, `created_at`) VALUES(1, '2010-06-01 22:08:55', 'sdffasdfadgasdcawc2cwe', 'sdfsdf', '2010-06-01 22:08:55', NULL, 0, '127.0.0.1', 1, 1, 0, '2010-06-01 22:08:55')
SELECT * FROM `topics` WHERE (`topics`.`id` = 15) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 22:41:20')
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.deleted_at IS NULL OR users.deleted_at > '2010-06-09 22:41:20') LIMIT 1
UPDATE `posts` SET `updated_at` = '2010-04-26 14:42:26', `position` = 1 WHERE `id` = 9
UPDATE `topics` SET `posts_count` = 1, `updated_at` = '2010-06-03 21:57:48' WHERE `id` = 12