app/controllers/replies_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`topic_id` = '12') AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 22:15:23') ORDER BY created_at desc LIMIT 10
---
  def index
    @post = Post.find(params[:post_id])
    @post.viewed_count += 1
    @post.save
    @topic = Topic.find(params[:topic_id])
#    @replies = Reply.find(:all, :conditions => {:post_id => params[:post_id]})
    @replies = Reply.paginate :page => params[:page], :conditions => {:post_id => params[:post_id]}, :per_page => 5
    @user = @post.user
    @latest_posts = Post.find(:all, :conditions => {:topic_id => params[:topic_id]}, :order => 'created_at desc', :limit =>10)