app/controllers/replies_controller.rb

  def index
    @post = Post.find(params[:post_id])
    @post.viewed_count += 1
    @post.save
    @topic = Topic.find(params[:topic_id])
#    @replies = Reply.find(:all, :conditions => {:post_id => params[:post_id]})
    @replies = Reply.paginate :page => params[:page], :conditions => {:post_id => params[:post_id]}, :per_page => 5
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 9) AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 22:15:23')
UPDATE `posts` SET `viewed_count` = 1, `updated_at` = '2010-05-24 14:08:38' WHERE `id` = 2
SELECT * FROM `topics` WHERE (`topics`.`id` = 12) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 22:15:23')
SELECT * FROM `replies` WHERE (`replies`.`post_id` = '9') AND (replies.deleted_at IS NULL OR replies.deleted_at > '2010-06-09 22:15:23') LIMIT 0, 5
SELECT count(*) AS count_all FROM `replies` WHERE (`replies`.`post_id` = '10')

  def show
    @post = Post.find(params[:post_id])
    @topic = Topic.find(params[:topic_id])
    @reply = Reply.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
SELECT * FROM `replies` WHERE (`replies`.`id` = 1)

  def new
    @reply = Reply.new
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:post_id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 12) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 22:37:57')
SELECT * FROM `posts` WHERE (`posts`.`id` = 8) AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 22:37:57')

  def create
    @reply = Reply.new(params[:reply])
    post_id = params[:post_id]
    @reply.post_id = post_id
    @reply.user_id = current_user.id
    topic_id = params[:topic_id]
    @post = Post.find(params[:post_id])
    @post.replies_count += 1
    @post.replied_at = @reply.created_at
    @post.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 8) AND (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 22:37:59')
INSERT INTO `replies` (`updated_at`, `text`, `deleted_at`, `post_id`, `ip`, `user_id`, `created_at`) VALUES('2010-06-03 19:33:39', 'sdafasdfdsaf', NULL, 4, NULL, 1, '2010-06-03 19:33:39')
UPDATE `posts` SET `replied_at` = NULL, `replies_count` = 1, `updated_at` = '2010-05-25 20:45:54' WHERE `id` = 10