app/controllers/topics_controller.rb

  def index
#    @topics = Topic.find(:all)
    @new_topics = Topic.find(:all, :order => 'created_at desc', :limit => 10)
    @tags = Topic.tag_counts
    @active_posts = Post.find(:all, :order => 'replied_at desc', :limit => 10)
---
SELECT * FROM `topics` WHERE (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 20:22:58') ORDER BY posts_count desc LIMIT 20
SELECT * FROM `posts` WHERE (posts.deleted_at IS NULL OR posts.deleted_at > '2010-06-09 20:22:58') ORDER BY replied_at desc LIMIT 10

  def show
    @topic = Topic.find(params[:id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 0) AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-23 20:22:39')

  def create
    unless simple_captcha_valid?
      flash[:error] = "invalid captcha code"
      redirect_to :action => "new"
      return
    end
    @topic = Topic.new(params[:topic])
    @topic.user_id = current_user.id
    @topic.ip = get_client_ip request

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`cached_tag_list`, `updated_at`, `title`, `deleted_at`, `replies_count`, `ip`, `posts_count`, `user_id`, `viewed_count`, `created_at`) VALUES('ddd, aaa', '2010-06-01 22:05:45', 'new topic', NULL, 0, NULL, 0, 1, 0, '2010-06-01 22:05:45')

  def search
    text = params[:search_text]
    @topics = Topic.find(:all, :conditions => ['title LIKE ?', '%' + text + '%'])
---
SELECT * FROM `topics` WHERE (title LIKE '%aaaaaaaaa%') AND (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-09 20:24:18')

  def popular
    @topics = Topic.paginate :page => params[:page], :order => "posts_count desc", :per_page => 10
---
SELECT * FROM `topics` WHERE (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-23 20:36:29') ORDER BY posts_count desc LIMIT 0, 25
SELECT count(*) AS count_all FROM `topics` WHERE (topics.deleted_at IS NULL OR topics.deleted_at > '2010-06-23 20:44:27')