app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.name = @user.login
    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `deleted_at`, `remember_token_expires_at`, `remember_token`, `login`, `image`, `email`, `created_at`) VALUES('', '15588313d0f0fb21f1459c1851c9409e56bb6ddd', '2010-06-01 22:04:54', '52c1d6e84b31816955d35113fbaafe43b0aafccb', NULL, NULL, NULL, 'david', 'P1010012.JPG', 'david@mail.com', '2010-06-01 22:04:54')
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'jedi') AND (users.deleted_at IS NULL OR users.deleted_at > '2010-06-22 21:12:34') LIMIT 1

  def show
    @user = User.find(params[:id])
    @activities = Activity.paginate :page => params[:page], :conditions => {:user_id => @user.id}, :order => "created_at desc", :per_page => 25
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.deleted_at IS NULL OR users.deleted_at > '2010-06-09 21:31:00') LIMIT 1
SELECT * FROM `activities` WHERE (`activities`.`user_id` = 1) ORDER BY created_at desc LIMIT 0, 25
SELECT count(*) AS count_all FROM `activities` WHERE (`activities`.`user_id` = 1)